#+TITLE: Kapitel 10: Fehlerbehandlung -- Exceptions 
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo


** Exceptions behandeln: geschützter Block 

Wir brauchen neue Schlüsselworte: 
- ~try~: Definierte einen geschützten Block
- ~except~: Nach einem geschützten Block; Code zur Fehlerbehandlung
  - Code selbst: ein block!
- Assoziation von ~try~ und ~except~: Gleiche Einrückung 

#+BEGIN_SRC python :exports both :results output
  try:
      d = {'a': 17, 'b': 42}
      d['c']
  except:
      print("Ein Fehler ist aufgetreten")

  print("Es geht hier weiter") 
#+END_SRC 

#+RESULTS:
: Ein Fehler ist aufgetreten
: Es geht hier weiter


** Semantik von ~try~ / ~except~, Fehlerfall  

- Anweisung im Block von ~try~ ausführen
- Bei Auftreten von Fehler:
  - Mit Anweisungen nach ~except~ weitermachen
  - Effekte der Anweisung des ~try~-Blocks bleiben erhalten 


#+BEGIN_SRC python :exports both :results output
  x = 17
  try:
      x = 42
      y = 5/0
  except:
      print("Aufgefangen")
  print("x: ", x)
#+END_SRC 

#+RESULTS:
: Aufgefangen
: x:  42

** Nur Fehler bestimmten Typs behandeln 

~except~ kann Klasse der zu behandelnden  Exception als Parameter bekommen 


#+BEGIN_SRC python :exports both :results output
  try:
      d = {'a': 17, 'b': 42}
      d['c']
  except KeyError:
      print("Ein Fehler ist aufgetreten")

  print("Es geht hier weiter") 
#+END_SRC 

#+RESULTS:
: Ein Fehler ist aufgetreten
: Es geht hier weiter

** Auf mehrere Fehlerklassen vorbereitet sein 

Auf einen ~try~-Block dürfen mehrere ~except~-Anweisungen folgen 

#+BEGIN_SRC python :exports code :results output
  try:
      d = {'a': 17, 'b': 42}
      d['c']
  except KeyError:
      print("Ein Schlüssel-Fehler ist aufgetreten")
  except IndexError:
      print("Ein Index-Fehler ist aufgetreten")

  print("Es geht hier weiter") 
#+END_SRC 

#+RESULTS:
: Ein Schlüssel-Fehler ist aufgetreten
: Es geht hier weiter


*** LookupError vor KeyError 

#+BEGIN_SRC python :exports code :results output
  try:
      d = {'a': 17, 'b': 42}
      d['c']
  except LookupError:
      print("Ein Lookup-Fehler ist aufgetreten")
  except KeyError:
      print("Ein Schlüssel-Fehler ist aufgetreten")

  print("Es geht hier weiter") 
#+END_SRC 

#+RESULTS:
: Ein Lookup-Fehler ist aufgetreten
: Es geht hier weiter



*** KeyError vor LookupError 

#+BEGIN_SRC python :exports code :results output
  try:
      d = {'a': 17, 'b': 42}
      d['c']
  except KeyError:
      print("Ein Schlüssel-Fehler ist aufgetreten")
  except LookupError:
      print("Ein Lookup-Fehler ist aufgetreten")

  print("Es geht hier weiter") 
#+END_SRC 

#+RESULTS:
: Ein Schlüssel-Fehler ist aufgetreten
: Es geht hier weiter

** Exception-Objekt: Beispiel 

#+BEGIN_SRC python :exports both :results output
  try:
      x = 5/0
  except Exception as exc:
      print(exc)
      print(dir(exc))
      print(exc.args)
#+END_SRC 

#+RESULTS:
: division by zero
: ['__cause__', '__class__', '__context__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__setstate__', '__sizeof__', '__str__', '__subclasshook__', '__suppress_context__', '__traceback__', 'args', 'with_traceback']
: ('division by zero',)

** Vorsicht: Exception-Objekt geht out of scope! 

#+BEGIN_SRC python :exports both :results output
  try:
      x = 5/0
  except Exception as exc:
      print(exc)
      print(dir(exc))
      print(exc.args)
    
  print(exc)
#+END_SRC 

#+RESULTS:
: division by zero
: ['__cause__', '__class__', '__context__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__setstate__', '__sizeof__', '__str__', '__subclasshook__', '__suppress_context__', '__traceback__', 'args', 'with_traceback']
: ('division by zero',)
: division by zero

** Fehlerfreier Fall: ~else~

Was, wenn keine Exception auftrat? Code für diesen Fall? 
- ~else~-Anweisung!
- Ähnlich wie bei Schleifen! 

#+BEGIN_SRC python :exports both :results output
  try:
      x = 5/1
  except Exception as exc:
      print(exc)
  else:
      print("Alles gut")
#+END_SRC 

#+RESULTS:
: Alles gut

** ~finally~ und Exceptions 

Trat eine Exception auf, die von keinem ~except~ behandelt wurde, so
wird ~finally~ ausgeführt und die Exception tritt danach wieder auf! 
- Beispiel: 


#+BEGIN_SRC python :exports both :results output
  def divide(x, y):
      try:
          result = x / y
      except ZeroDivisionError:
          print("division by zero!")
      else:
          print("result is", result)
      finally:
          print("executing finally clause")

  divide(2, 1)
  divide(2, 0)
  # divide("2", "1")
#+END_SRC 

#+RESULTS:
: result is 2.0
: executing finally clause
: division by zero!
: executing finally clause


** ~try~ in ~try~ : Beispiel

#+BEGIN_SRC python :exports both :results output
  try:
      # nenner = 0 
      nenner = 10**-10000
      try:
          x = 5/nenner
      except OverflowError:
          print("das wird zu groß")
          x = 0
  except ArithmeticError as e:
      print("irgendwas arithmatisches ging schief: ", e)
      x = 42

  print(x)
#+END_SRC 

#+RESULTS:
: irgendwas arithmatisches ging schief:  float division by zero
: 42




** ~try~, Funktionsaufruf, ~try~  : Beispiel 



#+BEGIN_SRC python :exports both :results output
  def f(nenner):
      try:
          x = 5/nenner
      except OverflowError:
          print("das wird zu groß")
          x = 0
      return x

  try:
      # nenner = 0 
      nenner = 10**-10000
      val = f(nenner)
  except ArithmeticError as e:
      print("irgendwas arithmatisches ging schief: ", e)
      val = 42

  print(val)
#+END_SRC 

#+RESULTS:
: irgendwas arithmatisches ging schief:  float division by zero
: 42


*** Beispiel							    :animate:

#+BEGIN_SRC python :exports both :results output
  try:
      # irgendwas
      try:
          try:
              raise Exception("meine!")
          except:
              print("im dritten except")
          finally:
              print("im dritten finally")
      except:
          print("im zweiten except")
      finally:
          print("im zweiten finally")
  except:
      print("im ersten except")
  finally:
      print("im ersten finally")
#+END_SRC 

#+RESULTS:
: im dritten except
: im dritten finally
: im zweiten finally
: im ersten finally

** Ein ~except~, alle ~finally~ -- Beispiel 2 

Egal, ob direkt geschachtelt oder in Funktionen -- gleiches Verhalten 


#+BEGIN_SRC python :exports both :results output
  def action2():
      print(1 + [])            # Generate TypeError

  def action1():
      try:
          action2()
      except TypeError:        # Most recent matching try
          print('inner except')
      finally:
          print('inner finally')

  try:
      action1()
  except TypeError:            # Here, only if action1 re-raises
      print('outer except')
  finally:
      print('outer finally')
    
#+END_SRC 

#+RESULTS:
: inner except
: inner finally
: outer finally




** Mehrere geschachtelte Schleifen abbrechen

- ~break~ bricht nur die innerste Schleife ab 
- Mit Exceptions: 

#+BEGIN_SRC python :exports both :results output
  class Exitloop(Exception): pass

  try:
      while True:
          while True:
              for i in range(10):
                  # break would just not do the job 
                  if i > 3: raise Exitloop          
                  print('loop3: %s' % i)
              print('loop2')
          print('loop1')
  except Exitloop:
      print('continuing')   
#+END_SRC 

#+RESULTS:
: loop3: 0
: loop3: 1
: loop3: 2
: loop3: 3
: continuing

Anmerkung: Zeigen Sie das keinem Software-Techniker :-) 

** Eigene Exception-Klassen 

Beispiel: Detaillierte Ausgabe von Parametern 

#+BEGIN_SRC python :exports both :results output
  class MyExcp(Exception):
      def __str__(self):
          return ("MyExcept deals with this: {}, {}. {}".format(
              self.args[0], self.args[1], self.args[2])
              )

  try:
      raise MyExcp("a", 2, 3)
  except MyExcp as e:
      print(e)
#+END_SRC 

#+RESULTS:
: MyExcept deals with this: a, 2. 3

** Exceptions in ~except~? -- Beispiel  

#+BEGIN_SRC python :exports both :results output
  try:
      try:
          x = 5/0
      except ArithmeticError:
          print("Anfang ArithmeticError Handler")
          raise IndexError
          print("Ende ArithmeticError Handler")
      except IndexError:
          print("im inneren IndexError Handler")
      finally:
          print("Finally im inneren try")
  except:
      print("Im outer exception handler")
#+END_SRC 

#+RESULTS:
: Anfang ArithmeticError Handler
: Finally im inneren try
: Im outer exception handler



** ~sys.exc_info~: Beispiel 


#+BEGIN_SRC python :exports both :results output
  # import machen wir in folgendem Kapitel 
  import sys
  try:
      raise IndexError("ein absichtlicher Fehler")
  except Exception:
      print(sys.exc_info())
    
#+END_SRC 

#+RESULTS:
: (<class 'IndexError'>, IndexError('ein absichtlicher Fehler',), <traceback object at 0x10107ce48>)

** Traceback -- Beispiel 

#+BEGIN_SRC python :exports both :results output
  import sys
  import traceback 
  def f():
      print("Anfang f")
      try:
          g()
      except IndexError:
          print("Index Error")
      print("Ende f")

  def g():
      raise ArithmeticError 

  try:
      f()
  except Exception:
      exc = sys.exc_info()
      tb = traceback.extract_tb(exc[2])
      print(tb)
#+END_SRC 

#+RESULTS:
: Anfang f
: [<FrameSummary file <stdin>, line 15 in <module>>, <FrameSummary file <stdin>, line 6 in f>, <FrameSummary file <stdin>, line 12 in g>]


